# ðŸ”„ Day 13: Advanced Reshaping (Pivot, Melt, Crosstab)

In [8]:
import pandas as pd

In [9]:
# Create the dummy data for Day 13
data = {
    'Department': ['HR', 'HR', 'IT', 'IT', 'Sales', 'Sales'],
    'Gender': ['Female', 'Male', 'Female', 'Male', 'Female', 'Male'],
    'Salary': [60000, 62000, 80000, 85000, 70000, 72000],
    "Date": ["2022-01-01", "2022-01-02", "2022-01-03", "2022-01-04", "2022-01-05", "2022-01-06"],
    "Company": ["Company A", "Company B", "Company C", "Company D", "Company E", "Company F"],
    "Price": [100, 200, 300, 400, 500, 600]
}

df = pd.DataFrame(data)

In [15]:
# Create a pivot table showing average Salary by Department and Gender
pivot_df = df.pivot_table(
    values='Salary', 
    index='Gender', 
    columns='Department', 
    aggfunc='mean'
)
pivot_df

Department       HR       IT    Sales
Gender
Female      60000.0  80000.0  70000.0
Male        62000.0  85000.0  72000.0

In [11]:
# Count how many employees of each Gender are in each Department
count_df = pd.crosstab(df['Department'], df['Gender'])
count_df

Gender      Female  Male
Department
HR               1     1
IT               1     1
Sales            1     1

In [12]:
# Show percentages instead of counts (normalize)
percent_df = pd.crosstab(df['Department'], df['Gender'], normalize='index')
percent_df

Gender      Female  Male
Department
HR             0.5   0.5
IT             0.5   0.5
Sales          0.5   0.5

In [13]:
data = {
    "Date": ["2026-01-01", "2026-01-02", "2026-01-03"],
    "Apple": [150, 152, 155],
    "Google": [2800, 2810, 2825],
    "Microsoft": [300, 305, 310]
}

# Create a DataFrame
df_stock_prices = pd.DataFrame(data)
df_stock_prices

         Date  Apple  Google  Microsoft
0  2026-01-01    150    2800        300
1  2026-01-02    152    2810        305
2  2026-01-03    155    2825        310

In [14]:
# Melt the dataframe
melted_df = df_stock_prices.melt(
    id_vars=['Date'],        # Column(s) to keep as identifier variables
    var_name='Company',      # Name for the new "variable" column
    value_name='Price'       # Name for the new "value" column
)
melted_df

         Date    Company  Price
0  2026-01-01      Apple    150
1  2026-01-02      Apple    152
2  2026-01-03      Apple    155
3  2026-01-01     Google   2800
4  2026-01-02     Google   2810
5  2026-01-03     Google   2825
6  2026-01-01  Microsoft    300
7  2026-01-02  Microsoft    305
8  2026-01-03  Microsoft    310